## Plan Result (sbox_global)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 10 to add, 1 to change, 9 to destroy.</code></pre>

* Create
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;labs-hub-ngfw-poc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;labs-hub-ngfw-poc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;labs-hub-ngfw-poc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;labs-hub-ngfw-poc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;labs-hub-ngfw-poc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;labs-hub-ngfw-poc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;labs-hub-ngfw-poc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;labs-hub-ngfw-poc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;labs-hub-ngfw-poc&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;labs-hub-ngfw-poc&#34;]
* Update
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
* Delete
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;hub-ngfw-poc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;hub-ngfw-poc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;hub-ngfw-poc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;hub-ngfw-poc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;hub-ngfw-poc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;hub-ngfw-poc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;hub-ngfw-poc&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;hub-ngfw-poc&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;hub-ngfw-poc&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["hub-ngfw-poc"] will be destroyed
  # (because key ["hub-ngfw-poc"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      - cdn_frontdoor_profile_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox" -> null
      - expiration_date          = "2024-02-13T16:21:51.8341098+00:00" -> null
      - host_name                = "labs-hub-ngfw.sandbox.platform.hmcts.net" -> null
      - id                       = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/customDomains/hub-ngfw-poc" -> null
      - name                     = "hub-ngfw-poc" -> null
      - validation_token         = "s9bp5nywg6ccdc1hs0d88wmj4r2b616w" -> null

      - tls {
          - cdn_frontdoor_secret_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/secrets/0--16389f89-9345-419f-8517-d90d50dccea1-labs-hub-ngfw-sandbox-platform-hmcts-net" -> null
          - certificate_type        = "ManagedCertificate" -> null
          - minimum_tls_version     = "TLS12" -> null
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["labs-hub-ngfw-poc"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox"
      + expiration_date          = (known after apply)
      + host_name                = "labs-hub-ngfw.sandbox.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "labs-hub-ngfw-poc"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["hub-ngfw-poc"] will be destroyed
  # (because key ["hub-ngfw-poc"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      - cdn_frontdoor_custom_domain_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/customDomains/hub-ngfw-poc" -> null
      - cdn_frontdoor_route_ids        = [
          - "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/afdEndpoints/hmcts-sbox/routes/hub-ngfw-poc",
        ] -> null
      - id                             = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/associations/hub-ngfw-poc" -> null
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["labs-hub-ngfw-poc"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["hub-ngfw-poc"] will be destroyed
  # (because key ["hub-ngfw-poc"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      - cdn_frontdoor_custom_domain_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/customDomains/hub-ngfw-poc" -> null
      - cdn_frontdoor_route_ids        = [
          - "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/afdEndpoints/hmcts-sbox/routes/hub-ngfw-pocHttpsRedirect",
        ] -> null
      - id                             = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/associations/hub-ngfw-poc" -> null
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["labs-hub-ngfw-poc"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom["hub-ngfw-poc"] will be destroyed
  # (because key ["hub-ngfw-poc"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
      - custom_block_response_status_code = 0 -> null
      - enabled                           = true -> null
      - frontend_endpoint_ids             = [] -> null
      - id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/hubngfwpocsboxPremium" -> null
      - mode                              = "Prevention" -> null
      - name                              = "hubngfwpocsboxPremium" -> null
      - resource_group_name               = "lz-sbox-rg" -> null
      - sku_name                          = "Premium_AzureFrontDoor" -> null
      - tags                              = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-platform-terraform"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
          - "startupMode"  = "always"
        } -> null

      - managed_rule {
          - action  = "Block" -> null
          - type    = "DefaultRuleSet" -> null
          - version = "1.0" -> null
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom["labs-hub-ngfw-poc"] will be created
  + resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + mode                  = "Prevention"
      + name                  = "labshubngfwpocsboxPremium"
      + resource_group_name   = "lz-sbox-rg"
      + sku_name              = "Premium_AzureFrontDoor"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }

      + managed_rule {
          + action  = "Block"
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin["hub-ngfw-poc"] will be destroyed
  # (because key ["hub-ngfw-poc"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_origin" "front_door_origin" {
      - cdn_frontdoor_origin_group_id  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/originGroups/hub-ngfw-poc" -> null
      - certificate_name_check_enabled = true -> null
      - enabled                        = true -> null
      - health_probes_enabled          = true -> null
      - host_name                      = "firewall-sbox-int-palo-sbox.uksouth.cloudapp.azure.com" -> null
      - http_port                      = 80 -> null
      - https_port                     = 443 -> null
      - id                             = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/originGroups/hub-ngfw-poc/origins/hub-ngfw-poc" -> null
      - name                           = "hub-ngfw-poc" -> null
      - origin_host_header             = "labs-hub-ngfw.sandbox.platform.hmcts.net" -> null
      - priority                       = 1 -> null
      - weight                         = 50 -> null
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin["labs-hub-ngfw-poc"] will be created
  + resource "azurerm_cdn_frontdoor_origin" "front_door_origin" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = true
      + enabled                        = true
      + health_probes_enabled          = (known after apply)
      + host_name                      = "firewall-sbox-int-palo-sbox.uksouth.cloudapp.azure.com"
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "labs-hub-ngfw-poc"
      + origin_host_header             = "labs-hub-ngfw.sandbox.platform.hmcts.net"
      + priority                       = 1
      + weight                         = 50
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group["hub-ngfw-poc"] will be destroyed
  # (because key ["hub-ngfw-poc"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_origin_group" "origin_group" {
      - cdn_frontdoor_profile_id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox" -> null
      - id                                                        = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/originGroups/hub-ngfw-poc" -> null
      - name                                                      = "hub-ngfw-poc" -> null
      - restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10 -> null
      - session_affinity_enabled                                  = false -> null

      - load_balancing {
          - additional_latency_in_milliseconds = 0 -> null
          - sample_size                        = 4 -> null
          - successful_samples_required        = 2 -> null
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group["labs-hub-ngfw-poc"] will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "origin_group" {
      + cdn_frontdoor_profile_id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox"
      + id                                                        = (known after apply)
      + name                                                      = "labs-hub-ngfw-poc"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
      + session_affinity_enabled                                  = false

      + load_balancing {
          + additional_latency_in_milliseconds = 0
          + sample_size                        = 4
          + successful_samples_required        = 2
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["hub-ngfw-poc"] will be destroyed
  # (because key ["hub-ngfw-poc"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      - cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/customDomains/hub-ngfw-poc",
        ] -> null
      - cdn_frontdoor_endpoint_id       = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/afdEndpoints/hmcts-sbox" -> null
      - cdn_frontdoor_origin_group_id   = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/originGroups/hub-ngfw-poc" -> null
      - cdn_frontdoor_origin_ids        = [
          - "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/originGroups/hub-ngfw-poc/origins/hub-ngfw-poc",
        ] -> null
      - cdn_frontdoor_rule_set_ids      = [] -> null
      - enabled                         = true -> null
      - forwarding_protocol             = "HttpOnly" -> null
      - https_redirect_enabled          = false -> null
      - id                              = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/afdEndpoints/hmcts-sbox/routes/hub-ngfw-poc" -> null
      - link_to_default_domain          = false -> null
      - name                            = "hub-ngfw-poc" -> null
      - patterns_to_match               = [
          - "/*",
        ] -> null
      - supported_protocols             = [
          - "Https",
        ] -> null

      - cache {
          - compression_enabled           = false -> null
          - content_types_to_compress     = [] -> null
          - query_string_caching_behavior = "UseQueryString" -> null
          - query_strings                 = [] -> null
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["labs-hub-ngfw-poc"] will be created
  + resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/afdEndpoints/hmcts-sbox"
      + cdn_frontdoor_origin_group_id   = (known after apply)
      + cdn_frontdoor_origin_ids        = (known after apply)
      + enabled                         = true
      + forwarding_protocol             = "HttpOnly"
      + https_redirect_enabled          = false
      + id                              = (known after apply)
      + link_to_default_domain          = false
      + name                            = "labs-hub-ngfw-poc"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Https",
        ]

      + cache {
          + compression_enabled           = false
          + query_string_caching_behavior = "UseQueryString"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B["hub-ngfw-poc"] will be destroyed
  # (because key ["hub-ngfw-poc"] is not in for_each map)
  - resource "azurerm_cdn_frontdoor_route" "routing_rule_B" {
      - cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/customDomains/hub-ngfw-poc",
        ] -> null
      - cdn_frontdoor_endpoint_id       = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/afdEndpoints/hmcts-sbox" -> null
      - cdn_frontdoor_origin_group_id   = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/originGroups/defaultBackend" -> null
      - cdn_frontdoor_origin_ids        = [
          - "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/originGroups/defaultBackend/origins/defaultBackend",
        ] -> null
      - cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/ruleSets/httpsredirect",
        ] -> null
      - enabled                         = true -> null
      - forwarding_protocol             = "MatchRequest" -> null
      - https_redirect_enabled          = false -> null
      - id                              = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/afdEndpoints/hmcts-sbox/routes/hub-ngfw-pocHttpsRedirect" -> null
      - link_to_default_domain          = false -> null
      - name                            = "hub-ngfw-pocHttpsRedirect" -> null
      - patterns_to_match               = [
          - "/*",
        ] -> null
      - supported_protocols             = [
          - "Http",
        ] -> null
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B["labs-hub-ngfw-poc"] will be created
  + resource "azurerm_cdn_frontdoor_route" "routing_rule_B" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/afdEndpoints/hmcts-sbox"
      + cdn_frontdoor_origin_group_id   = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/originGroups/defaultBackend"
      + cdn_frontdoor_origin_ids        = [
          + "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/originGroups/defaultBackend/origins/defaultBackend",
        ]
      + cdn_frontdoor_rule_set_ids      = [
          + "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/ruleSets/httpsredirect",
        ]
      + enabled                         = true
      + forwarding_protocol             = "MatchRequest"
      + https_redirect_enabled          = false
      + id                              = (known after apply)
      + link_to_default_domain          = false
      + name                            = "labs-hub-ngfw-pocHttpsRedirect"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Http",
        ]
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["labs-hub-ngfw-poc"] will be created
  + resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      + cdn_frontdoor_profile_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox"
      + id                       = (known after apply)
      + name                     = "labshubngfwpocsboxPremium-securityPolicy"

      + security_policies {
          + firewall {
              + cdn_frontdoor_firewall_policy_id = (known after apply)

              + association {
                  + patterns_to_match = [
                      + "/*",
                    ]

                  + domain {
                      + active                  = (known after apply)
                      + cdn_frontdoor_domain_id = (known after apply)
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["hub-ngfw-poc"] will be destroyed
  # (because key ["hub-ngfw-poc"] is not in for_each map)
  - resource "azurerm_dns_txt_record" "public_dns_record" {
      - fqdn                = "_dnsauth.labs-hub-ngfw.sandbox.platform.hmcts.net." -> null
      - id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/sandbox.platform.hmcts.net/TXT/_dnsauth.labs-hub-ngfw" -> null
      - name                = "_dnsauth.labs-hub-ngfw" -> null
      - resource_group_name = "reformmgmtrg" -> null
      - tags                = {} -> null
      - ttl                 = 3600 -> null
      - zone_name           = "sandbox.platform.hmcts.net" -> null

      - record {
          - value = "s9bp5nywg6ccdc1hs0d88wmj4r2b616w" -> null
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["labs-hub-ngfw-poc"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.labs-hub-ngfw"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "sandbox.platform.hmcts.net"

      + record {
          + value = (known after apply)
        }
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox|fd-log-analytics-logs-sa"
        name               = "fd-log-analytics-logs-sa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 10 to add, 1 to change, 9 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1983,"Program":"tfcmt","SHA1":"","Target":"sbox_global","Vars":{}} -->